Revit 2026 API

# MassSurfaceDataPercentageGlazing Property

---

The target percentage of the reference wall surface that is to be covered with automatically generated windows. Revit will use this number when determining the size, shape, and location of automatically generated windows.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double PercentageGlazing { get; set; }
```
```vb
Public Property PercentageGlazing As Double
	Get
	Set
```
```cpp
public:
property double PercentageGlazing {
	double get ();
	void set (double value);
}
```
```fsharp
member PercentageGlazing : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: The percentage glazing value is not between 0.00 and 0.95. |

The resulting coverage of the wall with windows is not guaranteed to match this value. It is a target.

#### Reference

MassSurfaceData Class

Autodesk.Revit.DB.Analysis Namespace